---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomLevelElevs
source: html/91b85bbf-4ae5-883f-3f51-f7720b1ca964.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomLevelElevs Property

A [Room]s Upper Limit must be above its Base Level.

## Syntax (C#)
```csharp
public static FailureDefinitionId RoomLevelElevs { get; }
```